[
  {
    "id": "21b4c65492d3b00deda21ac4f5b0663ffa2e128c",
    "title": "1926 to 2026: 100 Years Of Fianna Fáil",
    "link": "https://rednetwork.net/red-theory/2026/01/1926-to-2026-100-years-of-fianna-f%C3%A1il/",
    "published": "2026-01-05T00:00:00+00:00",
    "summary": "The horrible 100 year long history of the A-team of Irish capitalism",
    "content_html": "<p>The horrible 100 year long history of the A-team of Irish capitalism</p><p>When Eamonn DeValera led Fianna Fáil into the Dáil after the June 1927 election the newly elected Fianna Fáil TDs had revolvers in their pockets. They seemed like radical gunslingers, the smell of gunsmoke still on their jackets. DeValera had broken with Sinn Féin to form Fianna Fáil and make his way back to parliamentary politics. The new party had an aura of radicalism, helped by a panicked establishment press which tried to paint Dev and his gunmen as ‘communists’ and ‘Bolsheviks’ - but they were no such thing.</p><p>DeValera would soon own some of the most influential newspapers in Ireland, and in the 1930s he sat down with Archbishop McQuaid to write a conservative constitution, which was adopted in 1937. Soon Fianna Fáil were the establishment - the party to court with a brown envelope stuffed with cash if you wanted land rezoned or to get your hands on taxpayer cash to fund your new business.</p><p>Between them the two right wing parties, Fianna Fáil and Fine Gael, ruled the roost for decades. Political debate was suffocating, a charade of choosing between one right wing set of policies or another. It seemed like this right wing consensus could never be broken. We were trapped in an endlessly repeating cycle of Fianna Fáil and Fine Gael.</p><p>The 2020 election in Ireland was truly historic. There was a tidal wave vote for change. In the working class areas there was a huge vote for Sinn Féin and a significant vote for the radical left. Even Sinn Féin were shocked at the level of support they got - they hadn’t run enough candidates to scoop up all the potential votes. People were sick to death of the two-party system, exchanging Fianna Fáil for Fine Gael or vice versa.</p><p>The election opened up the possibility of Ireland’s first “left government”. “Vote left, transfer left” became a key slogan of the election and this was evident in the extent of Sinn Féin transfers that went to the radical left. But all that hope was dashed when the Green Party went into coalition with the two main right wing parties, Fine Gael and Fianna Fáil, who had dominated Irish politics since the foundation of the state. People were frustrated and furious. Since then the establishment has been able to use immigration as a wedge issue to chip away at Sinn Féin support.</p><p>The recent Presidential election again showed a strong vote for change. But why has Ireland been a two-party state for a century?</p><p>Fianna Fáil was founded by Eamonn DeValera in 1926 and he led them into the Dáil in 1927. DeValera had led the anti-treaty IRA but wanted to get back into mainstream political life. The new party tried to present itself as a ‘national movement’ - open to all classes. DeValera was careful to court workers, and stole the thunder of the weak Labour Party.</p><p>The Fianna Fáil economic policy was ‘protectionist’ - they were for building up native industry behind a wall of protective trade tariffs. This differentiated them from Cumann na nGaedheal who wanted to maintain trade links with Britain. With the union leaders and Labour Party reluctant to challenge Irish capitalism, Fianna Fáil were able to convince workers that protectionism would offer more jobs and a better economy.</p><p>When Fianna Fáil spoke out against capitalism it was always British capitalism that was the problem, not our own Irish bosses. They were able to capture working class anger after the global crash of 1929 and focus it within this nationalist framework. When unemployment rose - it was the British! When poverty rose - it was the British! It certainly was the case that the legacy of Imperialism had retarded the Irish economy, but it was also the case that we had our own layer of elite exploiters.</p><p>In most countries in Europe there is a clear left/right divide. There are right wing parties like the British Tories, who represent the wealthiest capitalists and landlords, and there are Social Democratic or Labour parties who are supposed to represent the working class, but fail to. So in Britain the Labour Party had thousands of working class organisations affiliated to it - it was seen as the natural political home for workers.</p><p>In Ireland the legacy of the Empire meant that nationalist freedom fighters were able to capture working class support for Irish capitalism. Irish workers weren’t just duped, they were promised economic advances by Fianna Fáil and genuinely believed their anti-British rhetoric. After all, 800 years of cruel British oppression, with the partition of the country leaving a chunk in the hands of Imperialism, meant there was a progressive or anti-Imperial side to the nationalism of Irish workers.</p><p>But it was being used by a ruling class faction to get workers to support their own local exploiters. Fianna Fáil’s protectionist economic policy was giving voice to the needs of a whole class of small factory owners who couldn’t compete on the open market with the larger and more established British companies. And they successfully wed workers to this capitalist led ‘national movement’.</p><p>In the 1932 election Fianna Fáil won enough seats to form a government, with support from the Labour Party. Cumann na nGaedheal helped Fianna Fáil appear more radical than they were by stirring up a red scare and insinuating that DeValera was getting his orders from Communists in Russia. Fianna Fáil became the political home for many Dublin workers who were unimpressed with the Labour Party.</p><p>Once in power Fianna Fáil took some progressive measures - like ending land annuity payments to the British. They also established many Irish state companies like Aer Lingus and Bord na Móna. But driving the Irish state machine required utilising the power of the Church to keep workers in line. DeValera understood this, and despite being excommunicated for opposing the treaty, he courted the Church hierarchy eventually working with the bishops to write the 1937 constitution.</p><p>They balanced strengthening the counter revolutionary state with throwing crumbs to workers to keep them on board. They introduced the right to collective bargaining for workers at the same time as banning women from many industries, effectively dividing the working class. Elite opposition to Fianna Fáil still existed in the form of the far right Blueshirt movement, led by ex-Garda commissioner Eoin O’Duffy. The union leaders used the rise of the Blueshirts to justify jumping into bed with Fianna Fáil.</p>",
    "author": "James O'Toole"
  },
  {
    "id": "7e207ab8af11e248e0f52459361c3502fe46acfd",
    "title": "The Trouble With Trotskyism",
    "link": "https://rednetwork.net/red-theory/2025/12/the-trouble-with-trotskyism/",
    "published": "2025-12-23T00:00:00+00:00",
    "summary": "The working class in Ireland needs revolutionary politics to win but Trotskyism doesn’t provide it.",
    "content_html": "<p>The working class in Ireland needs revolutionary politics to win but Trotskyism doesn’t provide it.</p><p>It’s time to leave Trotskyism in the dustbin of history. To many this will seem like a left bubble debate but all the main forces on the Irish socialist left come from the Trotskyist tradition. If you want to understand the Irish left you can’t ignore Trotskyism. The Socialist Workers’ Network runs People Before Profit and is a sister organisation to the British Socialist Workers’ Party, part of the International Socialist Tendency. The Socialist Party and the so-called Revolutionary Communists both emerged from the Militant tendency, another British Trotskyist movement that spent many years inside the British Labour Party.</p><p>I want to argue that Trotskyism is the left wing of the middle class left. It’s not a working class ideology. Its job is to unconsciously sabotage the working class movement. It’s as far as you can travel towards real working class Marxism while still standing in the shoes of the middle class. That’s not to say that Leon Trotsky didn’t occasionally say interesting or worthwhile things and there’s no point denying the role he played as president of the St. Petersburg Soviet in 1905 and again in 1917, the leading role he played in the 1917 October Revolution or in the building of the revolutionary Red Army. Everyone should read his “History of the Russian Revolution”. But many of his political flaws continue today in many of his supporters.</p><p>There are many good individual Trotskyist activists. They mostly join whatever organisation they encounter first and then adopt its politics wholesale. Even the best of those individuals, as this article will explain, damage the left whether they know they’re doing it or not. We need a return to the actual revolutionary working class politics of the Bolsheviks - a return to fighting to build a working class party that while embedded in the wider struggles of our class holds onto principled politics. Trotskyism involves a distortion and falsification of Lenin. I don’t intend to do a comprehensive overview of Trotsky’s entire output but will highlight those aspects of his approach that still inform the modern Trotskyist left.</p><p>Let’s start with some of the political weaknesses inherent in Leon Trotsky himself. Like most Russian activists who came into activity in the years of rising struggle in the 1890s he helped to build workers’ unions. He helped build the South Russian Workers’ Union. He was initially attracted to Lenin’s principled “Iskra” group, who were known as the most orthodox and most revolutionary of Russian Marxists. Lenin was fighting for all the separate circles and factions that had grown out of the rising strike movement to unite into one socialist party with a clear revolutionary programme.</p><p>At the Second Congress of the Russian Social Democratic Labour Party, the first real meeting of all these separate circles, the new party split into two main factions: the revolutionary Bolsheviks and the reformist Mensheviks. Leon Trotsky went into the room promising to defend Lenin but dropped his principles over the hurt feelings of some older famous intellectuals. The Mensheviks refused to subordinate these famous intellectuals to collective party democracy. Trotsky left the meeting in the opportunist Menshevik camp. “The Congress,” said Trotsky “has neither the moral nor the political right to refashion the editorial board. It is too delicate a question”. A party conference can’t vote to remove intellectuals from a leading body because it would hurt their feelings? It’s “too delicate a question” to ask each candidate to show their work and outline their political line? Lenin later explained the stakes:</p><p>“The issue thus came down to this: circles or a party? Were the rights of delegates to be restricted at the Congress in the name of the imaginary rights or rules of the various bodies and circles, or were all lower bodies and old groups to be completely, and not nominally but actually, disbanded in face of the Congress, pending the creation of genuinely Party official institutions?”</p><p>The intellectuals weren’t willing to subordinate their egos to the collective democracy of a united party. They wanted to keep their separate circles. They called Lenin “Robespierre” (the French revolutionary) and said he was a “dictator” because he argued they should respect the collective democracy of the party. The future Menshevik leader Julius Martov suggested a formulation of party membership that was so broad any worker could have claimed to be a member - but this would have created such a loose party that there would be no discipline. Formally it sounded like a “broad” membership base was better, in fact it would have allowed indiscipline to reign supreme. How could any revolution coordinate mass struggles against a state as monstrous as the Tsarist dictatorship without a cohesive organisation leading those struggles?</p><p>Lenin understood that while it sounded like a pro-worker formulation Martov’s idea of a broad party was actually about helping the intellectuals stay in their small circles and disrupt working class discipline: “In words, Martov’s formulation defends the interests of the broad strata of the proletariat, but in fact it serves the interests of the bourgeois intellectuals, who fight shy of proletarian discipline and organisation.” Lenin’s idea was for a tight organisation of revolutionaries who were organically embedded in wider struggle, lending the wider struggle organizational cohesion and revolutionary political guidance.</p><p>After the split the Mensheviks counterposed Lenin’s politics to the “self-training of the proletariat” in struggle. This sounded very bottom up and is repeated to this day by many Trotskyist groups, particularly People Before Profit. Lenin saw through it, it was a con job: “The proletariat will do nothing to have the worthy professors and high-school students who do not want to join an organisation recognised as Party members merely because they work under the control of an organisation. The proletariat is trained for organisation by its whole life, far more radically than many an intellectual prig. Having gained some understanding of our programme and our tactics, the proletariat will not start justifying backwardness in organisation by arguing that the form is less important than the content. It is not the proletariat, but certain intellectuals in our Party who lack self-training in the spirit of organisation and discipline, in the spirit of hostility and contempt for anarchistic talk.”</p><p>The whole concept of “self-training of the proletariat” was a way for the intellectual wing of the movement to claim to workers that the workers didn’t need clear politics and a disciplined party of their own. According to the Mensheviks a loose party thrown into struggle after struggle was supposed to automatically produce worker leaders, in fact it disarmed them. Lenin understood this would not be the case and that without an organisation of worker leaders the working class would remain subordinate to the liberal opposition to the Tsar. Lenin understood the secret: the middle class within the Marxist left was disarming the workers for the middle class outside the working class left to then take over and actually lead the movement.</p><p>The whole “self-training of the proletariat” line saw the Mensheviks reach back into the poverty stricken theories of what was called “Economism” - a reformist trend that many of the Menshevik leaders had previously joined Lenin in criticising. Lenin had written his famous booklet “What Is To Be Done?” against Economism, arguing against the idea that merely organising unions or going on strike would by itself create worker leaders. But now the Mensheviks needed a stick to beat Lenin with and refused to discuss the real issues at hand. Lenin was personally slandered, the real debate (about party discipline and democracy) was hidden behind a fog of gross misrepresentation. Leon Trotsky was chosen by the Mensheviks to attack Lenin in a pamphlet.</p><p>Trotsky wrote: “The year which has just passed has been a year which has weighed heavily in the life of our Party… But the basic task… may in general be formulated as consisting of the development of the self-activity of the proletariat.” Trotsky argued that the: “watchword ‘self-activity of the proletariat’ became a living and, let us hope, life-giving slogan.” Trotsky also argued that subordination to party democracy would lead to dictatorship: “In the internal politics of the Party these methods lead, as we shall see below, to the Party organisation “substituting” itself for the Party, the Central Committee substituting itself for the Party organisation, and finally the dictator substituting himself for the Central Committee.”</p><p>The irony was that Trotsky and the Menshevik leader Martov had had no problem with Lenin’s “What Is To Be Done?” for a whole year before the conference split! They did an about turn and found new “principles” so they could contrast their trend to Lenin’s. It was only after the conference they went looking for any argument that could be used against Lenin in order to defend their pandering to intellectuals’ egos and hurt feelings. This was gross opportunism. The Mensheviks started a boycott and active sabotage of the new party and older intellectuals like Georgi Plekhanov gave in and let them onto the central bodies without any vote by members, leading to Lenin’s resignation in protest at these undemocratic maneuvers.</p><p>Trotsky wrote on behalf of the Russian revolutionary intelligentsia, expressing their desire to continue leading the workers: “According to Lenin’s new philosophy… the proletariat only needs to have been through the “schooling of the factory” in order to give the intelligentsia… lessons in political discipline!… not the “school of the factory” but the school of political life, in which the Russian proletariat penetrates only under the leadership – good or bad – of the social democratic intelligentsia.”</p><p>Trotsky spent the next few years shifting back and forth between the Bolsheviks and Mensheviks, often criticising both. But when there’s a tug of war and someone stands in the middle pulling both ways, they’re not helping the revolutionary cause. He tried to bring all the factions who opposed the Bolsheviks together into an eclectic alliance which soon fell apart. ”Trotsky groups all the enemies of Marxism” wrote Lenin. When Lenin later criticised Menshevik deputies elected to the Tsarist Duma (a parliament), Trotsky condemned Lenin and said that Lenin’s criticism of the party’s parliamentary work threatened a split, Lenin replied: “Is it not monstrous to see something offensive in a calm acknowledgement of mistakes… Does this not show the sickness in our Party?” Lenin’s attitude was that the workers should be in on every debate.</p>",
    "author": "James O'Toole"
  },
  {
    "id": "6a539c02b2d71566d9afd3f92b4e21fa169ccfb3",
    "title": "What Do We Mean By Revolution?",
    "link": "https://rednetwork.net/red-theory/2025/11/what-do-we-mean-by-revolution/",
    "published": "2025-11-07T00:00:00+00:00",
    "summary": "What would a working class revolution actually look like?",
    "content_html": "<p>What would a working class revolution actually look like?</p><p>When you say Ireland needs a revolution people often don’t understand exactly what you mean. It conjures up images of a small group of people storming the GPO and hoping for the best. But a working class revolution is about a massive show of people power because the path to a new society is in part shaped by how you get there.</p><p>Imagine the water charges movement but even bigger and more sustained. Now imagine that accompanied by mass strikes by workers, shutting down the flow of profit to the greedy bosses. A strike that covered the whole country would have to be coordinated, that would mean forming committees to organise that coordinated action.</p><p>In past revolutions like in Russia in 1905 and 1917 or in Chile in 1973 workers formed their own democratic mass assemblies, they were called “Soviets” in Russia and “Cordones” in Chile. They democratically coordinated the working class fightback.</p><p>Moderate and middle class socialists saw these assemblies merely as a way to fight but not as the embryo of a new workers’ state that was emerging from below. Revolutionary groups like the Russian Bolsheviks argued for “All Power To The Soviets!” encouraging workers to keep fighting until all the bosses and landlords were kicked out of power.</p><p>The bosses have economic and political power. If you just occupy the workplaces but leave the state intact they’ll come evict you. If you challenge state power without the backing of strikes in workplaces you are weakened and you don’t create the embryo of a new alternative state power.</p><p>A severe economic or political crisis can provoke massive shows of people power - as we saw after the bank bailouts in 2008, but the system can rely on their state machine to use two key methods of control to stop a revolution, they’ll use the carrot and the stick.</p><p>They can call new elections to try divert people from the streets and workplaces to the debate in parliament and when this fails they use force, sending the Guards in to evict workers who are occupying a workplace, or to confront protesters.</p><p>We saw the state in action during the Debenhams strike where they sent the riot squad in to remove workers who were just asking for their redundancy payments. Or just look at the campaign of slander they directed against a moderate challenge to their power when Catherine Connolly won the Presidency.</p><p>The Indignados movement in Spain saw tens of thousands occupy squares across the country but when the ruling class called elections the street movement, which had no clear political wing, was disoriented.</p><p>While having no party of their own can disarm workers, so can having the wrong type of party representing workers. In the final year of the 1960s there was a million and a half strike days lost as workers fought back with flying pickets and militant strikes.</p><p>Labour benefited from this explosion of militancy and they used this support to guide the movement back into safe channels, they went into coalition with Fine Gael in 1973 and demoralised the workers preparing the ground for the return of Fianna Fáil in 1977.</p><p>Often concessions are made with the clear intention of disarming the movement and then when the level of militancy falls back they move against those who are still fighting.</p><p>In the case of the Russian Revolution of 1905 the ruthless Tsarist regime offered a parliament to calm the workers - the liberals and moderate socialists jumped for this carrot, at the same time the Tsar had his secret police organised pogroms, a campaign of mass murder, against Jewish workers and the left.</p><p>In Greece the radical left party Syriza formed a government and then backtracked on all their promises when threatened by the EU and the Greek rich. This demoralised workers and led to a collapse in the level of protest.</p><p>We saw the same thing in miniature here in Ireland when the water charges movement challenged Fianna Fáil and Fine Gael and they offered Marriage Equality and Repeal to seem like they were making concessions to progress. They were just trying to shore up their voter base to keep the show on the road.</p>",
    "author": "James O'Toole"
  }
]