[
  {
    "id": "87f02c68744cc9f31c80759fc2dcee35456decf7",
    "title": "Dublin City Council Tenants Face Rent Hike",
    "link": "https://rednetwork.net/articles/2025/11/dublin-city-council-tenants-face-rent-hike/",
    "published": "2025-11-11T00:00:00+00:00",
    "summary": "Council tenants face a proposed rent hike by the council who claim it’s to pay for maintenance",
    "content_html": "<p>Council tenants face a proposed rent hike by the council who claim it’s to pay for maintenance</p><p>Tenants in social housing across Dublin City Council face rent hikes with a proposal to raise rents from 15% of income to 18%. They also want to hit subsiduary earners in each household with a higher rate of rent.</p><p>This would see many of the poorest working class families in Dublin hit with higher rents in the middle of a cost of living crisis.</p><p>Many people in council housing spent 15 to 20 years on housing lists or years in homeless accommodation to eventually get into social housing and for many low paid working families the low rent rate provides a chance to save a little for the first time in their lives.</p><p>Taking €5 a week from someone on disability allowance or an extra €50 or more from a working family is a big deal when food and energy prices are through the roof. If someone working is on €400 a week and lives alone they can expect a 14% increase.</p><p>If they live with two adult earners the rent will increase by 47%, but if there are four additional adults in the house, the rent will rise by 60%!</p><p>The council claim that rents haven’t risen in 30 years but that’s not true because the rents have always been a percentage of income which means that as wages and welfare payments have risen over the years so has the rent each persons pays in absolute numbers.</p><p>The council says they need the money to pay for maintaining council estates but central government has spent 40 years intentionally running down our estates in order to drive people into the private market to rent or to buy.</p><p>I remember growing up in Fatima Mansions flats how the government offered people a carrot and a stick. They brought in the surrender grant to entice workers to leave social housing and then they used the stick of running down the estates to make people want to leave.</p><p>They took the live in caretakers out of many estates as social housing building collapsed in the 1980s as government after government pandered to the private markets. The results are still with us to this day.</p><p>The council claims the gap in funding for housing maintenance and annual income is €55.5 million. The rent changes would steal an additional income of €35.5 million by picking the pockets of the poor.</p><p>Now they want council tenants to take food out of their kids mouths in order to pay for maintaining estates that were intentionally run down by government.</p><p>The councils have other revenue raising powers - they could raise rates on big businesses, they could go after developers and landlords who leave sites derelict or vacant, they could demand funding from central government.</p><p>The council made €401.5 million from rates on businesses in 2024. They haven’t been collecting the vacant site tax - they received a single payment of €1.7 million from the Dublin Port Company but hundreds of landlords and developers haven’t coughed up a cent!</p><p>The council is owed tens of millions for these vacant sites, far more than the money they’re trying to take from council tenants. Why not take this seriously? Collect the money owed and push sites back into use to tackle the housing crisis.</p><p>Tenants from council housing from a few estates have come together to call a protest outside the full council meeting on Monday December 1st at City Hall on Dame Street Dublin at 6pm.</p>",
    "author": "James O'Toole"
  }
]