[
  {
    "id": "6a539c02b2d71566d9afd3f92b4e21fa169ccfb3",
    "title": "What Do We Mean By Revolution?",
    "link": "https://rednetwork.net/red-theory/2025/11/what-do-we-mean-by-revolution/",
    "published": "2025-11-07T00:00:00+00:00",
    "summary": "What would a working class revolution actually look like?",
    "content_html": "<p>What would a working class revolution actually look like?</p><p>When you say Ireland needs a revolution people often don’t understand exactly what you mean. It conjures up images of a small group of people storming the GPO and hoping for the best. But a working class revolution is about a massive show of people power because the path to a new society is in part shaped by how you get there.</p><p>Imagine the water charges movement but even bigger and more sustained. Now imagine that accompanied by mass strikes by workers, shutting down the flow of profit to the greedy bosses. A strike that covered the whole country would have to be coordinated, that would mean forming committees to organise that coordinated action.</p><p>In past revolutions like in Russia in 1905 and 1917 or in Chile in 1973 workers formed their own democratic mass assemblies, they were called “Soviets” in Russia and “Cordones” in Chile. They democratically coordinated the working class fightback.</p><p>Moderate and middle class socialists saw these assemblies merely as a way to fight but not as the embryo of a new workers’ state that was emerging from below. Revolutionary groups like the Russian Bolsheviks argued for “All Power To The Soviets!” encouraging workers to keep fighting until all the bosses and landlords were kicked out of power.</p><p>The bosses have economic and political power. If you just occupy the workplaces but leave the state intact they’ll come evict you. If you challenge state power without the backing of strikes in workplaces you are weakened and you don’t create the embryo of a new alternative state power.</p><p>A severe economic or political crisis can provoke massive shows of people power - as we saw after the bank bailouts in 2008, but the system can rely on their state machine to use two key methods of control to stop a revolution, they’ll use the carrot and the stick.</p><p>They can call new elections to try divert people from the streets and workplaces to the debate in parliament and when this fails they use force, sending the Guards in to evict workers who are occupying a workplace, or to confront protesters.</p><p>We saw the state in action during the Debenhams strike where they sent the riot squad in to remove workers who were just asking for their redundancy payments. Or just look at the campaign of slander they directed against a moderate challenge to their power when Catherine Connolly won the Presidency.</p><p>The Indignados movement in Spain saw tens of thousands occupy squares across the country but when the ruling class called elections the street movement, which had no clear political wing, was disoriented.</p><p>While having no party of their own can disarm workers, so can having the wrong type of party representing workers. In the final year of the 1960s there was a million and a half strike days lost as workers fought back with flying pickets and militant strikes.</p><p>Labour benefited from this explosion of militancy and they used this support to guide the movement back into safe channels, they went into coalition with Fine Gael in 1973 and demoralised the workers preparing the ground for the return of Fianna Fáil in 1977.</p><p>Often concessions are made with the clear intention of disarming the movement and then when the level of militancy falls back they move against those who are still fighting.</p><p>In the case of the Russian Revolution of 1905 the ruthless Tsarist regime offered a parliament to calm the workers - the liberals and moderate socialists jumped for this carrot, at the same time the Tsar had his secret police organised pogroms, a campaign of mass murder, against Jewish workers and the left.</p><p>In Greece the radical left party Syriza formed a government and then backtracked on all their promises when threatened by the EU and the Greek rich. This demoralised workers and led to a collapse in the level of protest.</p><p>We saw the same thing in miniature here in Ireland when the water charges movement challenged Fianna Fáil and Fine Gael and they offered Marriage Equality and Repeal to seem like they were making concessions to progress. They were just trying to shore up their voter base to keep the show on the road.</p>",
    "author": "James O'Toole"
  }
]