[
  {
    "id": "6477f65aef4b6f36886f76b963ebc452d7742b92",
    "title": "Every Workers Needs To Support The Covalen Strike",
    "link": "https://rednetwork.net/articles/2026/01/every-workers-needs-to-support-the-covalen-strike/",
    "published": "2026-01-15T00:00:00+00:00",
    "summary": "Covalen workers are back on picket lines, Francis O’Reilly explains why this strike is so important",
    "content_html": "<p>Covalen workers are back on picket lines, Francis O’Reilly explains why this strike is so important</p><p>Covalen workers took to the picket line once again to take on their corporate bosses over redududancy payments to workers. These skilled workers are taking a brave stand for union recognition and redundancy payments.</p><p>The company has failed to engage on these issues with the Communication Workers Union and workers are escalating their actions with two days of strike action this week. The company wants to sack 300 workers and leave them with nothing except statutory redundancy.</p><p>This is bad even by tech industry standards and workers who have less than two years working at the company won’t even get statutory redundancy. This is shameful behaviour from a wealthy company.</p><p>Covalen is owned by CPL, which in turn is own by Japanese company Outsourcing Inc and this company is ultimately owned by US firm Bain Capital. Bain Capital is a US investment firm based in Boston, with around $185 billion of assets under management.</p><p>They can well afford to give decent redundancy terms to workers here in Ireland.</p><p>CPL was run by Anne Heraty who was on over €500,000 a year and made over €100 million from the sale to Outsourcing Inc. CPL had made a fortune during Covid by getting state cash - figures show HSE spending under 7 pathways including CPL healthcare, CPL healthcare ltd came to over €163 million.</p><p>Bain Capital owns hundreds of companies and ruthlessly pursues profit at all costs. The Covalen workers are subcontracted to do work for Meta. The top managers at Bain Capital get salaries of over $1 million a year!</p><p>The Covalen workers are standing up to these greedy corporate giants.</p><p>Ian McArdle, deputy secretary of the CWU said: “How these workers are being treated by Covalen, with offers of redundancy terms that fall well short of industry norms and the company’s refusal to engage with their union representatives, is totally unacceptable.”</p><p>The company even cut back on lunches which used to be provided to workers. This represents around a €3,000 a year cut for workers. The workers demands are as follows:</p><p>Union recognition at the Nova Atria site, improved redundancy packages, a review of pay and pay structures, including recognition of service, formal recognition of roles, including Legal Operations and Specialist Quality Review, fairer annual leave and sick leave policies and genuine hybrid and remote working options.</p><p>Sustained strike action is the only way to bring these companies to heel and get them to respect the workers who actually generate all their profits. Rank and file workers need to keep pressure up on their union to call an all out strike that can beat the bosses.</p><p>We need to support every strike action by workers in every way we can but also keep fighting until we have a democratically planned economy, with workers in the driving seat, so that no corporation can ever mistreat workers the way Covalen has done.</p>",
    "author": "Francis O'Reilly"
  },
  {
    "id": "e47fd1e244a8435742a962cf9675f80e11e3b1d6",
    "title": "EU Liberals And Far Right Goons Unite To Support US Attack On Venezuela",
    "link": "https://rednetwork.net/articles/2026/01/eu-liberals-and-far-right-goons-unite-to-support-us-attack-on-venezuela/",
    "published": "2026-01-03T00:00:00+00:00",
    "summary": "When it comes down to it upper class liberals and far right manipulators are all tied to the same system.",
    "content_html": "<p>When it comes down to it upper class liberals and far right manipulators are all tied to the same system.</p><p>Trumps act of piracy in attacking Venezuela and kidnapping its President shines a light on the real class interests at play in modern politics as warmongering EU liberals and far right politicians both line up to offer justifications for a US grab for oil.</p><p>EU Vice President Kaja Kallas said that the “EU is closely monitoring the situation in Venezuela” and added that “Mr Maduro lacks legitimacy”. Now compare these measly words to their reaction to any action by Russia?</p><p>Kallas, after all, did let slip once that if the EU couldn’t beat Russia how could they beat China in a future war? Imagine her reaction if Russia had kidnapped Zelensky last night or if China had bombed Taiwan and kidnapped the government there?</p><p>Far right British Reform Party leader Nigel Farage echoed similar sentiments to the pro-war EU liberals when he said that Trump’s actions were “contrary to international law” but “may be a good thing” if they sent a message to Russia and China.</p><p>Farage wants to defend capitalism by diverting working class attention onto immigrants. The EU liberals put on the pretence of having progressive values while defending same Thatcherite economics Farage does.</p><p>They’ll all be dragged along by their class interests and ties to corporate powers towards a new round of global slaughter.</p><p>Trump has sent a message to warmongers in the EU, in NATO and across the globe - the gloves are off for imperialists and we can just grab what we want. This will make the world a far more unstable place.</p><p>The drive to war is escalating everywhere with the US voting through a trillion dollar arms package and the EU voting through €800 billion. Working class people everywhere face a cost of living crisis while our rulers squander billions on preparations for war.</p><p>In any future wars it will be workers pitted against workers and that’s why the EU wants the Irish government to tear up our neutrality. They want to send our kids off to fight for EU bankers in future wars against Russia and China.</p><p>War is no accident of personality. It is the corporate economic competition at the heart of capitalism spilling over into military competition. Profit rates have been stagnating for decades and the power that be want to use military might to grab resources and spheres of influence.</p><p>The only way war will be beaten is if workers in every country build a movement to overthrow their own ruling class. In Ireland that means working hard in the estates and workplaces on every issue that matters to workers so we can build a network of fighters, embedded in the working class, who can turn any future crisis in the direction of revolt against this system.</p>",
    "author": "Cllr Madeleine Johansson"
  },
  {
    "id": "cb0e7fe046dc03412688217cdc243d0963e0d710",
    "title": "Red Network New Years Statement 2026",
    "link": "https://rednetwork.net/articles/2026/01/red-network-new-years-statement-2026/",
    "published": "2026-01-01T00:00:00+00:00",
    "summary": "In a world of chaos only the working class offers a way out.",
    "content_html": "<p>In a world of chaos only the working class offers a way out.</p><p>The world is in turmoil. For many working class people the current state of the world seems incomprehensible. From the continuing slaughter in Gaza to the escalating drive to war from the heads of the EU and NATO. Trump now looks set to attack Venezuela.</p><p>At home, from the pressures of the cost of living crisis to the housing crisis, working class people feel angry, frustrated and often feel powerless. A section of the establishment, from Trump in the US to Fianna Fail here at home, are using anti-immigrant rhetoric to further confuse and divide our class - all to divert attention from the neoliberal capitalist system and their own failures.</p><p>There was a period after the bank bailout of 2008 when it seemed as though change was coming. We had a massive fightback against the water charges here in Ireland, workers in Greece had 32 general strikes, mass movements in Spain fought against austerity and there were popular uprisings across the Arab world.</p><p>Unfortunately these struggles were unable to break through - often because they were led by those who wanted to merely propel themselves to power within the capitalist system - like the Greek radical left party Syriza did. In other cases, as with the Indignados or Occupy, these protest movements suffered from a lack of any political strategy at all and lost effectiveness as movements from below fell back.</p><p>The capitalist system is capable of adapting, more than many socialists had predicted. Some on the socialist left argue that capitalism is in “decay”, but it’s more accurate to say it’s on life support. It is a chaotic and crisis prone system but one look at the military might the US state can muster should put paid to any idea the overthrow of this system will be an easy matter. Their ruthless state machines intervene to save their system, as they did after the banks crashed, and capitalism will survive as long as workers are willing to accept reduced living standards, exploitation and the growing horror of further wars.</p><p>Neoliberalism has been hollowing out public services for decades, there are housing crises in all Western countries, most acute in big cities. The cost of living is continuing to increase for workers. But the capitalist state has unimaginable resources they can mobilise to prop up the capitalist class. This state machine has also proven its ability to co-opt or crush opposition movements in equal measure. Only a working class revolution can actually break it.</p><p>The capitalist system is driven by corporations’ constant need for expanding markets, to increase their falling profit margins, this means that imperialism is part and parcel of the system. War is no accident - it is economic competition spilling over into miltary conflict. The imperialist West has facilitated the slaughter of Palestinians by their watchdog Israel.</p><p>Though under serious pressure from popular protests across the globe they have continued to support the Israeli state as their most important ally in the Middle East. No matter what deal has been done Apartheid Israel will continue land theft, expulsion and expansion and the idea of the two state solution merely offers them cover to continue.</p><p>In recent weeks US President Donald Trump has ordered attacks on Venezuelan ships and killed over a hundred people by blowing up boats. Both Democrats and Republicans have voted through a near $1 trillion US military budget. The EU is spending €800 billion on arms and military equipment. The new head of MI6 Blaise Metreweli recently said that Britain is in a “space between war and peace.”</p><p>A French army chief said that France must be prepared to “lose children” in war. NATO Secretary-General Mark Rutte made a speech warning that “conflict is at our door” and that “we must be prepared for the scale of war our grandparents or great-grandparents endured.” No wonder working class people are feeling overwhelmed, just as they did in the approach to the First World War.</p><p>At home, Fianna Fáil and Fine Gael are ramping up war propaganda to undermine Irish neutrality. From the alleged drone attack during Zelensky’s visit, to claims of Ireland needing French warships for defence for the 2026 EU summit, there is a consistent drip feed pro-war message to instill fear in working people. This is exactly what the Swedish government did before joining NATO, undermining the long tradition of support for neutrality in the Swedish working class.</p><p>Socialists must fight to defend Irish neutrality, exposing government propaganda and lies while being aware the world is sliding down the path to military conflicts at an escalating pace. We have to point out the systemic reason for war - it is corporate competition spilling over from economic competition to military conflict and we have to never tire of repeating that the main enemy of workers in Ireland is at home - in the Dáil.</p><p>Because of all the turmoil in the world, objectively it should be a good time for the revolutionary left to grow. But many workers are confused. There have been electoral swings back towards the centre left in some countries but because of the nature of reformism this can just as quickly swing back again to the right.</p><p>Just look at Britain where Keir Starmer’s Labour won a landslide election in 2024 only to implement authoritarian policies, betray working class voters and open the door to former Tory Nigel Farage and his nasty Reform party. There has recently been spectacular interest in the new left wing “Your Party” led by Jeremy Corbyn. But arguments within the reformist leadership are already disrupting this party before it’s even got off the ground.</p><p>We’ve been through this movie before. We saw Syriza rise on a wave of hope for change and on a similar left reformist platform. They argued for the whole left to join them and many did as factions. In the end not one of these factions was able to prevent the betrayal once Syriza formed a government and the result was the complete demoralisation of the Greek working class and the return of the Greek version of Fianna Fáil.</p>",
    "author": "Red Network"
  },
  {
    "id": "abc7dc21d389cf014e00a351e9a971d4aa9fb7e6",
    "title": "Trumped Up Attack On Venezuela",
    "link": "https://rednetwork.net/articles/2025/12/trumped-up-attack-on-venezuela/",
    "published": "2025-12-18T00:00:00+00:00",
    "summary": "The US used to regard South America as its back garden, that’s why Trump is on the prowl.",
    "content_html": "<p>The US used to regard South America as its back garden, that’s why Trump is on the prowl.</p><p>The US has a long history of violence against the people of South America. They’ve encouraged coups from Guatamala to Chile, funded terrorists and destroyed economies. Tens of thousands have died because of their actions.</p><p>The notorious U.S. Army School of the Americas trained over 60,000 Latin American military personnel, including officers who were involved in torture, massacres and human rights violations.</p><p>Trump wants to re-assert US corporate power over South America and is throwing out bullshit lie after bullshit lie to cover his imperialist tracks. As of last week, more than 30 of the 80 ships in Venezuelan waters were under US sanctions and US troops stole an oil tanker.</p><p>They took the oil tanker to a US port. There were no drugs on board, just oil which Trump claims was stolen from the US, as if the USA owns any oil produced in Venezuela. It carried 1.1 million barrels of crude oil worth $78 million.</p><p>On his Truth Social platform Trump wrote that Venezuela was “completely surrounded by the largest Armada ever assembled in the History of South America”. He added that it would “only get bigger” and “be like nothing they have ever seen before”.</p><p>The USS Gerald Ford – the world’s largest aircraft carrier – is now positioned within striking distance of Venezuela. The Pentagon has deployed more than 15,000 troops, F-35 stealth fighters and EA-18G Growler electronic warfare jets to the region.</p><p>The US military has killed over 100 people by targeting boats they claim are carrying drugs - but they’ve provided no evidence to back this up. Imagine the uproar across the West if Russia had murdered people at sea and stolen oil tankers?</p><p>Talk of Venezuelan drugs is the new “weapons of mass destruction” line we were fed to justify the US invasion of Iraq. The USA has a long history of intervention in Venezuela. In 1908, the US backed a coup that installed Juan Vicente Gómez, an evil dictator who ruled for 27 years, opening Venezuela’s oil wealth to the likes of the Rockefellers.</p><p>Trump wants to subjugate South America once more to US corporate power. On Friday, Trump announced that US ground attacks in the Caribbean would begin “pretty soon.” Trump’s “National Security Strategy”, released last month says that the United States will “deny non-Hemispheric competitors the ability to… own or control strategically vital assets, in our Hemisphere.”</p><p>The US establishment hopes that they can collapse the Venezuelan economy and install a US puppet that will allow them to steal that nation’s oil. China currently purchases roughly 80% of Venezuela’s oil exports. This is an attack on them.</p><p>Last week, the Democratic congressional leadership joined with the Republicans to pass the largest military budget ever in US history - the $901 billion National Defense Authorization Act. Both wings of the US ruling class support more war.</p><p>The Maduro government in Venezuela is corrupt but only the Venezuelan workers have the right to criticise that government. The political right in Venezuela want to invite in their imperialist masters and the result would be disaster for all workers and poor poeple in that country.</p><p>The so-called Bolivarian revolution in Venezuela saw a left wing government under Hugo Chávez implement masssive reforms. The US army responded by saying: “A few years after Chávez rose to power in 1999, he began implementing a political-strategic plan he called the ‘Bolivarian Revolution,’ which threatened North American rule by promising a Latin American liberation from the Monroe doctrine.”</p><p>Chávez funded massive social programs that helped workers and the poor, but it was all funded through oil revenue. This allowed Chávez to offer reform while leaving the capitalist class and their state machine intact. But the rich could use their vast economic power to strangle the economy undermining many efforts at reform.</p><p>The Venezuelan rich undermined efforts at reform, to build social housing and the sabotaged the roll out of state run grocery stores. At the same time the lack of control from below saw Maduro’s regime become incorporated into the capitalist state bureaucracy leading to massive corruption.</p>",
    "author": "James O'Toole"
  },
  {
    "id": "e11c9b11d2ddc6bb8b58f6ae766b2b9ffbe28a2d",
    "title": "Victory To The Caredoc Workers’ Strike",
    "link": "https://rednetwork.net/articles/2025/12/victory-to-the-caredoc-workers-strike/",
    "published": "2025-12-18T00:00:00+00:00",
    "summary": "Pickets have gone up across the South East today as SIPTU and INMO members strike for pay",
    "content_html": "<p>Pickets have gone up across the South East today as SIPTU and INMO members strike for pay</p><p>Caredoc workers across the Southeast are on strike today to protest over an 8% payrise they never got. There are 150 INMO members and 120 SIPTU members at Caredoc, these important workers include triage nurses, drivers for doctors and receptionists.</p><p>The workers are fighting for a 2023 Workplace Relations Commission pay agreement for Section 39 organisations - they were to get an 8% pay increase. The HSE gave €647,000 to Caredoc for the increase but this hasn’t been given to any workers.</p><p>INMO Industrial Relations Officer Gráinne Walsh said that CareDoc seem to be “philosophically opposed to using their profits to pay their staff a fair wage”. Where has the money paid by the HSE gone if the workers haven’t got it?</p><p>Caredoc provides GP out-of-hours services for patients with urgent medical problems while community intervention teams also provide care in the home services. These workers provide vital services and should be paid for it.</p><p>SIPTU and the INMO need to put pickets on Caredoc until the company folds. There also needs to be an investigation into where the HSE funds for workers’ pay went.</p><p>Caredoc is a publically funded private company. In the last 40 years we’ve seen a massive spread of outsourcing and privatisation of vital services as government after government pursues Thatcherite neoliberal policies.</p><p>The result is complex funding models and workers who are left out in the cold when it comes to public sector status. All these services should be provided by the state and regarded as public jobs.</p><p>There’s an argument about the status of Caredoc as a Section 39 organisation. The HSE says they have a General Medical Services contract, not a Section 39 arrangement. Although the HSE has given money for the wage increases.</p><p>Ultimately, as long as we live under a market driven system healthcare will be under threat from outsourcing and privatisation. Caredoc may be a non-profit private organisation but the whole model of giving public funds to private companies opens the door to full marketisation of the service.</p><p>This is why we say workers are dead right to strike for decent pay. Without strike action workers get walked over.</p><p>But we also need to look to the future and keep fighting for an economy where workers in a fully public health service can democratically decide how the service is funded, where workers are in the driving seat of a planned economy. Nothing less can secure the kind of health service we need.</p>",
    "author": "Francis O'Reilly"
  },
  {
    "id": "8de329f6dfe7ce0f607c71f7fb7251e6f529b860",
    "title": "Green Party And Labour Party Liars Back Fianna Fáil Fine Gael Council Rent Rise",
    "link": "https://rednetwork.net/articles/2025/11/green-party-and-labour-party-liars-back-fianna-f%C3%A1il-fine-gael-council-rent-rise/",
    "published": "2025-11-25T00:00:00+00:00",
    "summary": "Council tenant James O’Toole looks at the bull that came out of the mouths of Green and Labour Party councillors when they voted to raise council rents.",
    "content_html": "<p>Council tenant James O’Toole looks at the bull that came out of the mouths of Green and Labour Party councillors when they voted to raise council rents.</p><p>Councillors from Labour and the Greens lined up with Fianna Fáil and Fine Gael to vote through a council budget that included rent increases for council and HAP tenants. As usual they tried to spin it to make out the people picking the pockets of the poor are actually doing the victims a favour.</p><p>The Labour Party’s council group leader Darragh Moriarty said he thought it was “sick” to try and bring down the whole budget and “play politics” when people in social housing are living “in some of the worst living conditions in the State.”</p><p>So he voted with Fianna Fáil and Fine Gael to take the shortfalls in the council budget out of the pockets of the poorest families in Dublin? And he’s insinuating that years of neglect by the council is down to the rents paid by tenants!</p><p>It’s our own fault the areas are neglected and we have to shut up and pay more if we want any maintenence done. They’re basically holding maintenence hostage unless we give up our ability to save a few extra quid a week or maybe put money aside for a child’s college fund.</p><p>And the whole reason the council is short of money is because government after govermment has cut funding to the council. There was a deliberate strategy to run down social housing and push people into the hands of private profiteers.</p><p>The council tenants who gathered outside City Hall weren’t “playing politics” - they were defending their ability to survive and maybe have some hopes and dreams for the future. Labour are gaslighting the victims of this money grab.</p><p>Why not create revenue for the council by increasing rates on corporations? Or bring in a tourist tax? Instead Darragh Moriarty attacks council tenants who object to rent raises and blames them for the poor conditions the council has left estates in.</p><p>Green Party group leader Janet Horner was even more rabid accusing those objecting to the rent increases of doing a “cheap” political stunt for likes on Instagram:</p><p>“It is outrageous, it is insulting and its a cheap manipulative play on peoples lives in in order to gain a few likes on your Instagram….you are selling lies and snake oil.”</p><p>This is how she speaks to residents from Oliver Bond, Pearse House, Cromcastle Court and School Street flats who had gathered outside? Their concerns for their future and their fear of the cost of living crisis was all just a “cheap” political stunt?</p><p>The Greens are Thatcherites who like to recycle a bit. But the funny thing is being tied to the apron strings of Fianna Fáil and Fine Gael means they fail on that front too and end up pandering to corporate interests.</p><p>Green Cllr Michael Pigeon said: “There’s a clear direct line between the low rents we charge and the low crappy levels of maintenance we provide.”</p><p>So the council has been providing “crappy levels” of maintenance for decades and that was all because of low rents? That’s just a bare faced lie. Budgets were cut and the estates were run down and it’s being going on for years.</p><p>He’s saying to council tenants: we won’t give you maintenance unless you cough up more money!\" The only people “selling lies and snake oil” are the councillors belonging to Fianna Fáil and Fine Gael and the parrots in Labour and the Green Party who just echo the line they’ve been given by the establishment.</p><p>We should remember how they spoke about us, how they gaslit us, how they slandered us the next time they come knocking on any of our doors! Labour and the Greens represent the middle class. They don’t represent workers. And they know it.</p>",
    "author": "James O'Toole"
  },
  {
    "id": "7cd28a12f327618bf7e681ebb43d5969d9a56812",
    "title": "Government Talks Were Just Way To Kill School Secretary and Caretaker Pickets",
    "link": "https://rednetwork.net/articles/2025/11/government-talks-were-just-way-to-kill-school-secretary-and-caretaker-pickets/",
    "published": "2025-11-21T00:00:00+00:00",
    "summary": "Care worker and Forsa member Mark Kerins writes on the school secretaries and caretakers strike and the collapse of talks with the government.",
    "content_html": "<p>Care worker and Forsa member Mark Kerins writes on the school secretaries and caretakers strike and the collapse of talks with the government.</p><p>The news yesterday evening that talks with government had broken down with no progress on pension parity for school secretaries and caretakers will be met by massive frustration and anger all workers involved in the strike.</p><p>It is 12 weeks since the strike was called off. The government suggested that it was serious about pension fairness. But the government strategy was really about taking momentum away from a militant campaign by workers that had massive public support.</p><p>These workers currently do not have a pension equal to other public sector workers and after long service to our communities will not retire with a fair pension. Fórsa official Andy Pike said yesterday that: “The Department’s refusal to table a constructive proposal on this point has now brought the process to an impasse.”</p><p>So there you have it, months later and no plan from the employers side shows they were never serious about a resolution. The government lied to workers to end the strike because there was a real possibility of schools closing with the strike continuing.</p><p>Public pressure would have seen the government forced to concede to workers’ demands. But we have to be honest - our union leaders were also happy to end the strike, with SNA’s starting to refuse to cross pickets, they feared losing control of the strike and feared bad publicity.</p><p>We will never win if we’re afraid of workers’ solidarity, effective picketing and if we trust the bosses are true to their word.</p><p>The union should have stood its ground and been far stronger in continuing to escalate the strike. They had already seen previous broken promises, to work towards pension parity broken after the 2021 secretary strike was called off, yet fell into the government trap.</p><p>A promise to work towards a result means nothing to a government which has overseen record child homelessness, and record hospital waiting lists. So now with no progress the talks will move to the Labour Court for a uncertain decision.</p><p>This drags out the dispute and it is hard to see a resolution before Christmas. The state’s industrial relations process is designed by the government to frustrate workers power while giving the appearance of fairness.</p><p>It is designed to keep strikes in Ireland to a minimum and keep wages low to benefit employers. This has been a massive success for the bosses and for government and the consequence is that real wage growth has stopped completely over the last 30 years.</p><p>We are also far behind the rest of the EU when it comes to pensions, sick pay and other benefits – precisely because workers are told from above that we can’t fight for these rights due to our strike laws here.</p><p>We should stand behind the school secretaries and caretakers in their struggle for fairness because this could be you next. We need to get involved in our unions to push them to be more militant and to fight back.</p><p>We need to build a real fighting working class movement and within that build up a layer of working class socialists who know exactly what the government game is and refuse to play on the government’s terms.</p>",
    "author": "Mark Kerins"
  },
  {
    "id": "b7c7fd6f6ed787168e14985cbdcab203a2475236",
    "title": "Government’s New Old Housing Plan!",
    "link": "https://rednetwork.net/articles/2025/11/governments-new-old-housing-plan/",
    "published": "2025-11-14T00:00:00+00:00",
    "summary": "Cllr Madeleine Johansson looks at the government’s new housing plan and shows it just repackages the same old Fianna Fáil Fine Gael failures.",
    "content_html": "<p>Cllr Madeleine Johansson looks at the government’s new housing plan and shows it just repackages the same old Fianna Fáil Fine Gael failures.</p><p>The government’s new housing plan, published this week, is just more of the same. They try to dazzle us with numbers but as soon as you scratch the surface you see that this is a just continuation of their policy of handouts for developers and landlords - and consquently a continuation of the housing crisis for the working class.</p><p>While the target for new homes has increased to 300,000 by 2030 there are no substantial changes in how these will be delivered. The reliance on the private market continues with a target of only 12,000 new social homes a year. That’s only 72,000 social housing units when there’s already more than 147,000 in need of social housing between those on council housing lists and on HAP and RAS.</p><p>There is no plan to house all those people who need homes. The 12,000 doesn’t even represent much of an increase when compared to their pathetic delivery of 11,900 in 2023 and 10,600 in 2024. That’s they’ve scrapped yearly targets - they know they’ll just miss them again and again.</p><p>In the new plan the government boasts about their previous plan “Housing For All” and the 137,000 new homes built since 2021. However, if you compare these figures to previous years they’re well below the high point of home building during the Celtic Tiger with almost 90,000 new homes built in 2007 alone.</p><p>There is a recognition that housing is a EU wide problem. But they can’t talk about why this is happening, which is because of the privatisation of housing all across Europe. The plan intends to simply continue this neoliberal approach. They say that “Delivering Homes, Building Communities presents a renewed environment for private sector investment and development to deliver more homes.”</p><p>Part of this pandering to developers is a further reduction in apartment standards, which come on top of those that have already been introduced, and the changes in rent levels where rents can now be increased to completely unaffordable market levels for new tenancies.</p><p>There is more money for developers through a VAT reduction on apartments and further corporation tax reductions, both of which were already introduced in the 2026 Budget.</p><p>The re-zoning of more land for housing had already been started by local councils. This could become a cash cow for land owners who hoard land. They say that they will be “enforcing the Residential Zoned Land Tax; and strengthening the use of Compulsory Purchase Orders” but no details are included of how this will be done.</p><p>Land re-zoning has been more about enabling the profiteering of developers than providing housing. Those who have hoarded land will now line up to make a killing.</p><p>There’s increased funding of €2.5 billion to the Land Development Agency to continue “working in partnership to deliver more homes across all tenures, including social and private; backing more Small and Medium Enterprise housing developers”. More public money being spent on developers to build private houses!</p><p>Also, we’ve already heard how the government is intending to privatise the development of new standalone wastewater treatment plants to bolster the service provided by Uisce Éireann.</p><p>They’re also talking about reviewing the development contribution process. This is about the fees charged by local councils to developers for the provision of parks, community and other local services. It says it “will consider the impact of contributions on the viability of housing projects.”</p><p>That’s code for another giveaway to developers with a loss of public services and amenities for ordinary people.</p><p>In terms of lifelines for those facing eviction such as the tenant in situ scheme it’s non-existent in this plan. Government has already cut funding for the scheme. There’s no ban on evictions and there’s only one sentence that says:</p><p>“In respect of tenancy sustainment the acquisitions programme will continue to act as a necessary last resort policy tool available to local authorities to help prevent individuals or families falling into homelessness.”</p>",
    "author": "Cllr Madeleine Johansson"
  },
  {
    "id": "87f02c68744cc9f31c80759fc2dcee35456decf7",
    "title": "Dublin City Council Tenants Face Rent Hike",
    "link": "https://rednetwork.net/articles/2025/11/dublin-city-council-tenants-face-rent-hike/",
    "published": "2025-11-11T00:00:00+00:00",
    "summary": "Council tenants face a proposed rent hike by the council who claim it’s to pay for maintenance",
    "content_html": "<p>Council tenants face a proposed rent hike by the council who claim it’s to pay for maintenance</p><p>Tenants in social housing across Dublin City Council face rent hikes with a proposal to raise rents from 15% of income to 18%. They also want to hit subsiduary earners in each household with a higher rate of rent.</p><p>This would see many of the poorest working class families in Dublin hit with higher rents in the middle of a cost of living crisis.</p><p>Many people in council housing spent 15 to 20 years on housing lists or years in homeless accommodation to eventually get into social housing and for many low paid working families the low rent rate provides a chance to save a little for the first time in their lives.</p><p>Taking €5 a week from someone on disability allowance or an extra €50 or more from a working family is a big deal when food and energy prices are through the roof. If someone working is on €400 a week and lives alone they can expect a 14% increase.</p><p>If they live with two adult earners the rent will increase by 47%, but if there are four additional adults in the house, the rent will rise by 60%!</p><p>The council claim that rents haven’t risen in 30 years but that’s not true because the rents have always been a percentage of income which means that as wages and welfare payments have risen over the years so has the rent each persons pays in absolute numbers.</p><p>The council says they need the money to pay for maintaining council estates but central government has spent 40 years intentionally running down our estates in order to drive people into the private market to rent or to buy.</p><p>I remember growing up in Fatima Mansions flats how the government offered people a carrot and a stick. They brought in the surrender grant to entice workers to leave social housing and then they used the stick of running down the estates to make people want to leave.</p><p>They took the live in caretakers out of many estates as social housing building collapsed in the 1980s as government after government pandered to the private markets. The results are still with us to this day.</p><p>The council claims the gap in funding for housing maintenance and annual income is €55.5 million. The rent changes would steal an additional income of €35.5 million by picking the pockets of the poor.</p><p>Now they want council tenants to take food out of their kids mouths in order to pay for maintaining estates that were intentionally run down by government.</p><p>The councils have other revenue raising powers - they could raise rates on big businesses, they could go after developers and landlords who leave sites derelict or vacant, they could demand funding from central government.</p><p>The council made €401.5 million from rates on businesses in 2024. They haven’t been collecting the vacant site tax - they received a single payment of €1.7 million from the Dublin Port Company but hundreds of landlords and developers haven’t coughed up a cent!</p><p>The council is owed tens of millions for these vacant sites, far more than the money they’re trying to take from council tenants. Why not take this seriously? Collect the money owed and push sites back into use to tackle the housing crisis.</p><p>Tenants from council housing from a few estates have come together to call a protest outside the full council meeting on Monday December 1st at City Hall on Dame Street Dublin at 6pm.</p>",
    "author": "James O'Toole"
  }
]